easymeal-website/app/controllers/aliments_controller.rb

  def index
    @aliments = Aliment.all
---
SELECT "aliments".* FROM "aliments"

    def set_aliment
      @aliment = Aliment.find(params[:id])
---
SELECT "aliments".* FROM "aliments" WHERE "aliments"."id" = ? LIMIT 1  [["id", "980190962"]]