easymeal-website/app/controllers/allergen_and_favorite_aliments_controller.rb

SELECT "allergen_and_favorite_aliments".* FROM "allergen_and_favorite_aliments"
---
  def index
    @allergen_and_favorite_aliments = AllergenAndFavoriteAliment.all

INSERT INTO "allergen_and_favorite_aliments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]
---
  def create
    @allergen_and_favorite_aliment = AllergenAndFavoriteAliment.new(allergen_and_favorite_aliment_params)
    @allergen_and_favorite_aliment.user_id = current_user.id
    respond_to do |format|
      if @allergen_and_favorite_aliment.save

DELETE FROM "allergen_and_favorite_aliments" WHERE "allergen_and_favorite_aliments"."id" = ?  [["id", 980190962]]
---
  def destroy
    @allergen_and_favorite_aliment.destroy

SELECT "allergen_and_favorite_aliments".* FROM "allergen_and_favorite_aliments" WHERE "allergen_and_favorite_aliments"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_allergen_and_favorite_aliment
      @allergen_and_favorite_aliment = AllergenAndFavoriteAliment.find(params[:id])