easymeal-website/app/controllers/diet_types_controller.rb

  def index
    @diet_types = DietType.all
---
SELECT "diet_types".* FROM "diet_types"

  def create
    @diet_type = DietType.new(diet_type_params)

    respond_to do |format|
      if @diet_type.save
---
INSERT INTO "diet_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["name", "MyString"], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]

  def destroy
    @diet_type.destroy
---
DELETE FROM "diet_types" WHERE "diet_types"."id" = ?  [["id", 980190962]]

    def set_diet_type
      @diet_type = DietType.find(params[:id])
---
SELECT "diet_types".* FROM "diet_types" WHERE "diet_types"."id" = ? LIMIT 1  [["id", "980190962"]]