easymeal-website/app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes"
---
  def index
    @homes = Home.all

INSERT INTO "homes" ("city", "created_at", "householder", "street", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "MyString"], ["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["householder", 1], ["street", "MyString"], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]
---
  def create
    @home = Home.new(home_params)
    @home.householder = current_user
    @home.users << current_user

SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_home
      @home = Home.find(params[:home][:id])