easymeal-website/app/controllers/menu_schedules_controller.rb

  def index
    @menu_schedules = MenuSchedule.all
---
SELECT "menu_schedules".* FROM "menu_schedules"

  def create
    @menu_schedule = MenuSchedule.new(menu_schedule_params)

    respond_to do |format|
      if @menu_schedule.save
---
INSERT INTO "menu_schedules" ("created_at", "home_id", "updated_at", "weekNumber", "year") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["home_id", 1], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["weekNumber", 1], ["year", 1]]

    def set_menu_schedule
      @menu_schedule = MenuSchedule.find(params[:id])
---
SELECT "menu_schedules".* FROM "menu_schedules" WHERE "menu_schedules"."id" = ? LIMIT 1  [["id", "980190962"]]