easymeal-website/app/controllers/recipes_controller.rb

  def index
    if params[:search]
      @recipes = Recipe.liked(current_user).find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
    else
      @recipes = Recipe.liked(current_user)
    end
    recipes = []
    @recipes.each do |recipe|
---
SELECT "recipes".* FROM "recipes"

  def create
    respond_to do |format|
      if @recipe = Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]