easymeal-website/app/controllers/shopping_lists_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists"
---
  def index
    @shopping_lists = ShoppingList.all

INSERT INTO "shopping_lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]
---
  def create
    @shopping_list = ShoppingList.new(shopping_list_params)

    respond_to do |format|
      if @shopping_list.save

DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = ?  [["id", 980190962]]
---
  def destroy
    @shopping_list.destroy

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_shopping_list
      @shopping_list = ShoppingList.find(params[:id])