easymeal-website/app/controllers/stores_controller.rb

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("country", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["country", "MyString"], ["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["name", "MyString"], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00]]

    def set_store
      @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "980190962"]]