easymeal-website/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id]) if params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(user_params)
    abort
    @errors = []

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("birth", "created_at", "desireWeight", "dietTypeId", "firstname", "gender", "height", "home_id", "id", "idealWeight", "lastConnexion", "lastname", "lock", "loginAttempts", "mail", "password", "resetToken", "role", "updated_at", "username", "weightCurveId", "weightPointId") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)