easymeal-website/app/controllers/weight_points_controller.rb

INSERT INTO "weight_points" ("created_at", "date", "updated_at", "weight") VALUES (?, ?, ?, ?)  [["created_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["date", Sat, 03 May 2014], ["updated_at", Tue, 20 May 2014 09:42:25 UTC +00:00], ["weight", 1]]
---
  def create
    @weight_point = WeightPoint.new(weight_point_params)
    @weight_point.user_id = current_user.id

    respond_to do |format|
      if @weight_point.save

SELECT "weight_points".* FROM "weight_points" WHERE "weight_points"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_weight_point
      @weight_point = WeightPoint.find(params[:id])